In [45]:
import pandas as pd

In [46]:
# ------------------------------------------------------------
# ⿡ Create a DataFrame
# ------------------------------------------------------------
# Create a DataFrame with columns: Name, Age, and Marks
# Include 4 student records with at least one missing value.
# (Hint: Use a dictionary and pd.DataFrame())
# ------------------------------------------------------------



a = {
    "Name" : ['Chinnu','Somu','Chomu','Gomu'],
    "Age" : [1,22,None,23],
    "Marks" : [ 00,42,12,None]
}

df = pd.DataFrame(a)
df

     Name   Age  Marks
0  Chinnu   1.0    0.0
1    Somu  22.0   42.0
2   Chomu   NaN   12.0
3    Gomu  23.0    NaN

In [47]:



# ------------------------------------------------------------
# ⿢ Add a new column
# ------------------------------------------------------------
# Add a new column "Grade" with letter grades (A, B, C, etc.)
# ------------------------------------------------------------


df["Grade"] = ['A',"B","C","D"]
df

     Name   Age  Marks Grade
0  Chinnu   1.0    0.0     A
1    Somu  22.0   42.0     B
2   Chomu   NaN   12.0     C
3    Gomu  23.0    NaN     D

In [48]:

# ------------------------------------------------------------
# ⿣ Access specific columns
# ------------------------------------------------------------
# Display only the 'Name' and 'Marks' columns.
# ------------------------------------------------------------


df[['Name','Marks']]

     Name  Marks
0  Chinnu    0.0
1    Somu   42.0
2   Chomu   12.0
3    Gomu    NaN

In [49]:
# ------------------------------------------------------------
# ⿤ Count missing values
# ------------------------------------------------------------
# Count the number of missing values in each column.
# (Hint: df.isnull().sum())
# ------------------------------------------------------------

df.isnull().sum()

Name     0
Age      1
Marks    1
Grade    0
dtype: int64

In [50]:



# ------------------------------------------------------------
# ⿥ Handle missing values
# ------------------------------------------------------------
# Replace all missing values in 'Age' with the mean age.
# (Hint: df['Age'].fillna(df['Age'].mean(), inplace=True))
# ------------------------------------------------------------


#df['Age'].fillna(df['Age'].mean(),inplace=True)
df.fillna({'Age': df['Age'].mean()},inplace=True)
df

     Name        Age  Marks Grade
0  Chinnu   1.000000    0.0     A
1    Somu  22.000000   42.0     B
2   Chomu  15.333333   12.0     C
3    Gomu  23.000000    NaN     D

In [51]:

# ------------------------------------------------------------
# ⿦ Modify a specific cell
# ------------------------------------------------------------
# Change the Name in the 3rd row (index 2) to 'Sonu'.
# (Hint: df.loc[2, 'Name'] = 'Sonu')
# ------------------------------------------------------------


df.loc[3,'Name'] = 'Sonu'
df

     Name        Age  Marks Grade
0  Chinnu   1.000000    0.0     A
1    Somu  22.000000   42.0     B
2   Chomu  15.333333   12.0     C
3    Sonu  23.000000    NaN     D

In [52]:


# ------------------------------------------------------------
# ⿧ Add new rows to the DataFrame
# ------------------------------------------------------------
# Add two new rows:
# {'Name': 'Kumar', 'Age': 20, 'Marks': 90}
# {'Name': 'Rahul', 'Age': 26, 'Marks': 85}
# (Hint: Use pd.concat)
# ------------------------------------------------------------

new = pd.DataFrame([
    {'Name': 'Kumar', 'Age': 20, 'Marks': 90},
    {'Name': 'Rahul', 'Age': 26, 'Marks': 85}
]
)

df = pd.concat([df,new],ignore_index=True)
df

     Name        Age  Marks Grade
0  Chinnu   1.000000    0.0     A
1    Somu  22.000000   42.0     B
2   Chomu  15.333333   12.0     C
3    Sonu  23.000000    NaN     D
4   Kumar  20.000000   90.0   NaN
5   Rahul  26.000000   85.0   NaN

In [55]:
# ------------------------------------------------------------
# ⿨ Access data using loc
# ------------------------------------------------------------
# Access and print 'Name' and 'Marks' for the student at index 0.
# (Hint: df.loc[0, ['Name', 'Marks']])
# ------------------------------------------------------------

df.loc[0,['Name','Marks']]

Name     Chinnu
Marks       0.0
Name: 0, dtype: object

In [57]:

# ------------------------------------------------------------
# ⿩ Slicing rows and columns using loc
# ------------------------------------------------------------
# Display 'Name' and 'Marks' for rows 0 to 3.
# (Hint: df.loc[0:3, ['Name', 'Marks']])
# ------------------------------------------------------------


df.loc[0:3,["Name","Marks"]]

     Name  Marks
0  Chinnu    0.0
1    Somu   42.0
2   Chomu   12.0
3    Sonu    NaN

In [58]:
# ------------------------------------------------------------
# 🔟 Access rows and columns using iloc
# ------------------------------------------------------------
# Display the first and third rows, and first two columns.
# (Hint: df.iloc[0:3:2, 0:2])
# ----------------------------------------------

df.iloc[0:3:2,0:2]

     Name        Age
0  Chinnu   1.000000
2   Chomu  15.333333

In [65]:
# ------------------------------------------------------------
# ⿡⿡ Aggregate functions
# ------------------------------------------------------------
# Calculate and display:
# - Mean Age
# - Minimum Age
# - Maximum Age
# - Count of Age values
# ------------------------------------------------------------

print(df["Age"].mean())
print(df["Age"].min())
print(df["Age"].max())
print(df["Age"].count())

17.88888888888889
1.0
26.0
6

In [66]:

# ------------------------------------------------------------
# ⿡⿢ Grouping and aggregation
# ------------------------------------------------------------
# Group the DataFrame by 'Name' and compute the mean Age for each Name.
# (Hint: df.groupby('Name')['Age'].mean())
# ------------------------------------------------------------

df.groupby('Name')['Age'].mean()

Name
Chinnu     1.000000
Chomu     15.333333
Kumar     20.000000
Rahul     26.000000
Somu      22.000000
Sonu      23.000000
Name: Age, dtype: float64

In [68]:

# ------------------------------------------------------------
# 🧠 Bonus Challenge
# ------------------------------------------------------------
# Sort the DataFrame by 'Marks' in descending order and
# display the top 3 students.
# (Hint: df.sort_values(by='Marks', ascending=False).head(3))
# ------------------------------------------------------------

df.sort_values("Marks",ascending=False).head(3)

    Name   Age  Marks Grade
4  Kumar  20.0   90.0   NaN
5  Rahul  26.0   85.0   NaN
1   Somu  22.0   42.0     B

In [70]:
aa = df.groupby('Marks')
aa['Age'].mean()

Marks
0.0      1.000000
12.0    15.333333
42.0    22.000000
85.0    26.000000
90.0    20.000000
Name: Age, dtype: float64